app/controllers/job_controller.rb

  def index
    @search = Job.sorted.paginate(:page => params[:page], :per_page => 3).search(params[:q])
    #paginate(:page => params[:page], :per_page => 1)
    @jobs = @search.result.includes(:category)
---
SELECT `categories`.* FROM `categories`  WHERE `categories`.`id` IN (2)