app/controllers/resume_controller.rb

INSERT INTO `resumes` (`cover_letter`, `created_at`, `cv_content_type`, `cv_file_name`, `cv_file_size`, `cv_updated_at`, `job_id`, `updated_at`, `user_id`) VALUES ('', '2014-11-19 04:30:56', 'application/msword', 'stop-cv-format.doc', 31744, '2014-11-19 04:30:55', 2, '2014-11-19 04:30:56', 1)
---
  def create
    @resume = Resume.new(resume_params)
    @resume.user_id = current_user.id;
    if @resume.save